src/Catalogs/ПечатныеФормы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ПечатныеФормы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПечатнаяФормаПоУмолчанию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПечатныеФормы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПодключенныеФормы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Макет</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Процедура</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ПечатныеФормы/Forms/ФормаМакет/module.bsl
Перем СтрокаСправочника Экспорт;  //Ссылка на строку из табличной части печатной формы, для которой открыли эту форму
Перем ПФОбъект Экспорт; //Ссылка на объект, элемент справочника печатные формы 
Перем мБылоОтображение;


Процедура ПриОткрытии()
	Если ПФОбъект.Предопределенный Тогда
		ЭлементыФормы.КоманднаяПанель1.Кнопки.ЗагрузитьМакет.Доступность=Истина;
	КонецЕсли;
	ИмяФайла=КаталогВременныхФайлов()+"$$$MXL.mxl";
	ДвоичныеДанные = СтрокаСправочника.Макет.Получить();
	Если ДвоичныеДанные<>Неопределено Тогда
		Попытка
			ДвоичныеДанные.Записать(ИмяФайла);
			ЭлементыФормы.Макет.Прочитать(ИмяФайла);
		Исключение
			Сообщить("Не удалось сохранить файл """+ИмяФайла+""" !", СтатусСообщения.Важное);
		КонецПопытки;
	КонецЕсли;
	мБылоОтображение = Ложь;
	
	ПодключитьОбработчикОжидания("ОтображатьИменаСтрокКолонок",1,Истина);

КонецПроцедуры

Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	Если Модифицированность Тогда
		Ответ=Вопрос("Сохранить изменения ?", РежимДиалогаВопрос.ДаНетОтмена);
		Если Ответ = КодВозвратаДиалога.Да Тогда
			ОсновныеДействияФормыЗаписать(0);
		ИначеЕсли Ответ=КодВозвратаДиалога.Отмена Тогда
			Отказ=Истина;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Процедура ОтображатьИменаСтрокКолонок()
	// вот такой изврат для того чтобы включить опцию таблицы "Отображать имена строк/колонок"
	Если Не мБылоОтображение Тогда
		мБылоОтображение = Истина;
		WshShell = Новый ComОбъект("WScript.Shell");
        WshShell.SendKeys("{LEFT}{F10}{RIGHT}{RIGHT}{DOWN}{DOWN}{DOWN}{RIGHT}{DOWN}{ENTER}");
	КонецЕсли;

КонецПроцедуры

 
Процедура КоманднаяПанель1ЗагрузитьМакет(Кнопка)
	Если ПФОбъект.Предопределенный Тогда
		ИмяПФ=Справочники.ПечатныеФормы.ПолучитьИмяПредопределенного(ПФОбъект.Ссылка);
		ИмяСпр=СтрЗаменить(Справочники.ПечатныеФормы.ПолучитьИмяПредопределенного(ПФОбъект.Родитель),"Справочник","");
		ИмяФайла=КаталогВременныхФайлов()+"$$$MXL.mxl";
		Макет=Справочники[ИмяСпр].ПолучитьМакет(ИмяПФ);
		Макет.Записать(ИмяФайла);
		ЭлементыФормы.Макет.Прочитать(ИмяФайла);
		Модифицированность=Истина;
	КонецЕсли;

КонецПроцедуры

Процедура ОсновныеДействияФормыЗаписать(Кнопка)
	ИмяФайла=КаталогВременныхФайлов()+"$$$MXL.mxl";
	ЭлементыФормы.Макет.Записать(ИмяФайла);
	СтрокаСправочника.Макет=Новый ХранилищеЗначения(Новый ДвоичныеДанные(ИмяФайла), Новый СжатиеДанных());

КонецПроцедуры

Процедура ОсновныеДействияФормыОК(Кнопка)
	ОсновныеДействияФормыЗаписать(Кнопка);
	ЭтаФорма.Закрыть();

КонецПроцедуры
